content/post/weekly/0.org
#+title: Weekly#0
#+date: 2024-07-27T16:06:51+08:00
#+lastmod: 2024-07-27T16:06:51+08:00
#+draft: false
#+keywords[]:
#+description: ""
#+tags[]: weekly
#+categories[]: weekly

* 创刊语

平时会关注一些周刊，newsletter 等，然后将有用的文章整理到笔记中。

最早看到的应该是阮一峰的[[https://www.ruanyifeng.com/blog/weekly/][科技爱好者周刊]]，后面也关注了其他的一些个人周刊，想着为什么不自己也写一份呢？

一方面整理看到的内容，一方面也督促自己更新一下博客中的内容，或许写着写着，会想着写点别的东西呢？

所以就诞生了这份周刊，想不到什么好的名字，命名真是一件难事。

我本身是做前端开发的，关注的内容更多是前端相关的，也对文档编写，一些新潮的东西感兴趣，所以周刊的内容大概会是这些方面的居多。

我也很喜欢听歌，或许也可以分享一些平时喜欢的音乐~

* 信息来源

欢迎推荐更多 :)

- [[https://news.ycombinator.com/][Hacker News]]
- [[https://github.com/][GitHub]]
- [[https://www.ruanyifeng.com/blog/][阮一峰的网络日志]]
- [[https://javascriptweekly.com/][JavaScript Weekly]]
- [[https://nodeweekly.com/][Node Weekly]]
- [[https://css-weekly.com/][CSS Weekly]]
- [[https://bytes.dev/][BYTES]]
- [[https://github.com/timqian/chinese-independent-blogs][中文独立博客列表]]
- [[https://www.v2ex.com/][v2ex]]
- [[https://github.com/kilimchoi/engineering-blogs][A curated list of engineering blogs]]
- [[https://www.fre321.com/weekly][FRE123 技术周刊]]
