publish/0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-26 Thu 22:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Weekly#0</title>
<meta name="author" content="Spike Leung" />
<meta name="description" content="&quot;&quot;" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/index.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung">GitHub</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Weekly#0</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0bc14e7">创刊语</a></li>
<li><a href="#org1b31fa7">信息来源</a></li>
</ul>
</div>
</div>


<div id="outline-container-org0bc14e7" class="outline-2">
<h2 id="org0bc14e7">创刊语</h2>
<div class="outline-text-2" id="text-org0bc14e7">
<p>
平时会关注一些周刊，newsletter 等，然后将有用的文章整理到笔记中。
</p>

<p>
最早看到的应该是阮一峰的<a href="https://www.ruanyifeng.com/blog/weekly/">科技爱好者周刊</a>，后面也关注了其他的一些个人周刊，想着为什么不自己也写一份呢？
</p>

<p>
一方面整理看到的内容，一方面也督促自己更新一下博客中的内容，或许写着写着，会想着写点别的东西呢？
</p>

<p>
所以就诞生了这份周刊，想不到什么好的名字，命名真是一件难事。
</p>

<p>
我本身是做前端开发的，关注的内容更多是前端相关的，也对文档编写，一些新潮的东西感兴趣，所以周刊的内容大概会是这些方面的居多。
</p>

<p>
我也很喜欢听歌，或许也可以分享一些平时喜欢的音乐~
</p>
</div>
</div>

<div id="outline-container-org1b31fa7" class="outline-2">
<h2 id="org1b31fa7">信息来源</h2>
<div class="outline-text-2" id="text-org1b31fa7">
<p>
欢迎推荐更多 :)
</p>

<ul class="org-ul">
<li><a href="https://news.ycombinator.com/">Hacker News</a></li>
<li><a href="https://github.com/">GitHub</a></li>
<li><a href="https://www.ruanyifeng.com/blog/">阮一峰的网络日志</a></li>
<li><a href="https://javascriptweekly.com/">JavaScript Weekly</a></li>
<li><a href="https://nodeweekly.com/">Node Weekly</a></li>
<li><a href="https://css-weekly.com/">CSS Weekly</a></li>
<li><a href="https://bytes.dev/">BYTES</a></li>
<li><a href="https://github.com/timqian/chinese-independent-blogs">中文独立博客列表</a></li>
<li><a href="https://www.v2ex.com/">v2ex</a></li>
<li><a href="https://github.com/kilimchoi/engineering-blogs">A curated list of engineering blogs</a></li>
<li><a href="https://www.fre321.com/weekly">FRE123 技术周刊</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">

<p class="author">Author: Spike Leung (<a href="mailto:l-yanlei@hotmail.com">l-yanlei@hotmail.com</a>)</p>
<p class="date">Date: 2024-07-27 Sat 00:00</p>
</div>
</body>
</html>
